/**
  ******************************************************************************
  * @file    gld.h
  *
  * @brief   
      hfo - контур стабилизации мощности накачки лазера
      - контур регулированния коэффициента передачи усилителя фотоприемника
      cplc - контур регулирования длины оптического периметра периметра 
      ignit - система управления поджигом лазера
      dither - система управления виброприводом
      - система вычитания виброподставки
      
      command - система команд прибора ГЛД
      
  *
  * @author  Дмитрий Новиков novikov@elektrooptika.ru
  *
  ******************************************************************************
  * @attention
  *
  * в разработке
  *
  * <h2><center>&copy; 2020 Электрооптика</center></h2>
  ******************************************************************************
  */
#ifndef __GLD_H_INCLUDED 
#define __GLD_H_INCLUDED

#include "command.h"
#include "cplc.h"
#include "dither.h"
#include "hfo.h"
#include "thermo.h"
#include "ignit.h"

#include "sync.h"
#include "exchange.h"


#endif