/**
  ******************************************************************************
  * @file    utility.h
  *
  * @brief   Общие вспомогательные алгоритмы преобразований.
  *
  * @author  Дмитрий Новиков novikov@elektrooptika.ru
  *
  ******************************************************************************
  * @attention
  *
  * в разработке
  *
  * <h2><center>&copy; 2020 Электрооптика</center></h2>
  ******************************************************************************
  */
#include "types.h"


/**
* @brief преобразовать строку в число
* @param str входная строка
* @retval x_uint32_t перекодированное число
*/
x_uint32_t utility_convert_str2time(const x_uint8_t *str);